In [1]:
import pandas as pd#data analysis
import numpy as np#mathecal operations

In [2]:
real_estate=pd.read_csv("D:\ml datasets\Real estate.csv")

# step1:-data analysis and filter

In [3]:
real_estate.head(10)

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude,Y house price of unit area
0,1,2012.917,32.0,84.87882,10,24.98298,121.54024,37.9
1,2,2012.917,19.5,306.59470,9,24.98034,121.53951,42.2
2,3,2013.583,13.3,561.98450,5,24.98746,121.54391,47.3
3,4,2013.500,13.3,561.98450,5,24.98746,121.54391,54.8
4,5,2012.833,5.0,390.56840,5,24.97937,121.54245,43.1
5,6,2012.667,7.1,2175.03000,3,24.96305,121.51254,32.1
6,7,2012.667,34.5,623.47310,7,24.97933,121.53642,40.3
7,8,2013.417,20.3,287.60250,6,24.98042,121.54228,46.7
8,9,2013.500,31.7,5512.03800,1,24.95095,121.48458,18.8
9,10,2013.417,17.9,1783.18000,3,24.96731,121.51486,22.1

In [4]:
real_estate.drop('No',axis=1,inplace=True)

In [5]:
real_estate.head()

,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude,Y house price of unit area
0,2012.917,32.0,84.87882,10,24.98298,121.54024,37.9
1,2012.917,19.5,306.59470,9,24.98034,121.53951,42.2
2,2013.583,13.3,561.98450,5,24.98746,121.54391,47.3
3,2013.500,13.3,561.98450,5,24.98746,121.54391,54.8
4,2012.833,5.0,390.56840,5,24.97937,121.54245,43.1

# step 2:-divide data on independent variable and dependent variable

In [6]:
x=real_estate.drop('Y house price of unit area',axis=1)

In [7]:
y=real_estate['Y house price of unit area']

In [8]:
x.head()

,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude
0,2012.917,32.0,84.87882,10,24.98298,121.54024
1,2012.917,19.5,306.59470,9,24.98034,121.53951
2,2013.583,13.3,561.98450,5,24.98746,121.54391
3,2013.500,13.3,561.98450,5,24.98746,121.54391
4,2012.833,5.0,390.56840,5,24.97937,121.54245

In [9]:
y.head()

0    37.9
1    42.2
2    47.3
3    54.8
4    43.1
Name: Y house price of unit area, dtype: float64

# step3:- divide training and testing data

In [10]:
from sklearn.model_selection import train_test_split

In [15]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=10)

In [16]:
x_train.head()

,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude
52,2013.583,32.1,1438.5790,3,24.97419,121.51750
101,2012.833,12.7,170.1289,1,24.97371,121.52984
389,2013.250,40.9,122.3619,8,24.96756,121.54230
386,2012.833,0.0,185.4296,0,24.97110,121.53170
64,2013.333,17.5,995.7554,0,24.96305,121.54915

In [17]:
x_test.head()

,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude
231,2012.833,16.2,4074.73600,0,24.94235,121.50357
322,2013.000,12.9,187.48230,1,24.97388,121.52981
1,2012.917,19.5,306.59470,9,24.98034,121.53951
72,2013.583,32.5,424.54420,8,24.97587,121.53913
291,2012.833,3.4,56.47425,7,24.95744,121.53711

In [18]:
y_train.head()

52     27.0
101    32.9
389    67.7
386    55.3
64     25.3
Name: Y house price of unit area, dtype: float64

In [19]:
y_test.head()

231    14.7
322    33.1
1      42.2
72     36.3
291    54.4
Name: Y house price of unit area, dtype: float64

# step 4:-building a model

In [20]:
from sklearn.linear_model import LinearRegression

In [21]:
regressor=LinearRegression()

In [22]:
regressor.fit(x_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

# testing the model

In [23]:
y_pred=regressor.predict(x_test)

In [24]:
y_pred

array([13.17502502, 39.42938915, 47.02644092, 45.01411802, 44.46557029,
       17.25901037, 40.12177812, 53.62617677, 43.16481831, 31.85698337,
       32.37623254, 40.51902419, 36.8644201 , 41.83969518, 13.59668958,
       47.36080355, 26.05794856, 39.61191294, 31.3944316 , 50.2312201 ,
       43.96720482, 39.72721603, 29.71264637, 33.56318361, 29.77200931,
       45.68745806, 43.88826844, 36.52588665, 13.90877331, 39.40007608,
       23.22992036, 34.29836873, 37.52554486, 44.66522877, 36.60879279,
       42.830566  , 32.19771281, 43.52232634, 46.38857122, 53.14313208,
       46.30712292, 37.69500829, 34.63988145, 45.2035646 , 28.5327599 ,
       44.72860452, 37.56816955, 39.60035736, 47.7774787 , 41.48894859,
       37.0291408 , 44.39813362, 34.83523972, 46.40631309, 30.83725301,
       33.80159393, 30.63658623, 46.79016761, 49.39874609, 36.63561328,
       40.10190711, 42.67782282, 46.90457935, 43.30506434, 37.06257232,
       44.73891946, 37.66192217, 38.09187915, 43.01246116, 37.94157217,
       47.81604092, 51.45916519, 32.40356858, 43.24515007, 44.31507379,
       31.32586612, 15.900736  , 37.22621386, 16.80936655, 36.55270714,
       36.84352021, 48.59716334, 42.34203477])

In [25]:
y_pred.shape

(83,)

In [26]:
y_test.shape

(83,)

In [28]:
np.array(y_test)

array([14.7, 33.1, 42.2, 36.3, 54.4, 20.7, 55.2, 63.9, 41.9, 28.9, 28.6,
       31.1, 35.1, 42.5, 19.2, 59.6, 25.7, 52.2, 25.6, 63.2, 53. , 34.6,
       24.4, 34.2, 24.7, 40.8, 52.5, 31.3, 12.8, 34.1, 13.8, 38.8, 31.1,
       36.7, 32.9, 44. , 29.8, 48. , 41.2, 62.2, 50.7, 40.3, 29.4, 56.2,
       35.7, 38.2, 61.5, 63.3, 71. , 39.6, 34.6, 51.6, 62.9, 49.7, 25.3,
       23.7, 23.8, 54.4, 52.2, 34. , 39.3, 40.2, 51. , 44.3, 28.4, 38.6,
       35.3, 37. , 43.8, 42.7, 49. , 45.2, 28.8, 52.2, 40. , 27.7, 16.7,
       36.8, 29.3, 30.7, 37.5, 60.7, 53.3])

In [29]:
from sklearn.metrics import mean_squared_error

In [30]:
print("mean_sqaured error is:-",mean_squared_error(y_test,y_pred))

mean_sqaured error is:- 69.50825046592895